{
  "[PAD]": 0,
  "[UNK]": 1,
  "[MASK]": 2,
  "[CLS]": 3,
  "PRODUCT|HOVER_ELEMENT|HOVER_SHORT": 4,
  "PRODUCT|ZOOM_IMAGE|ZOOM": 5,
  "HOME|START_SESSION|NONE": 6,
  "HOME|ENTER_HOME|NONE": 7,
  "PRODUCT|ENTER_PRODUCT|NONE": 8,
  "PRODUCT|CLICK_ELEMENT|CLICK": 9,
  "PRODUCT|VIEW_PRODUCT|CLICK": 10,
  "PRODUCT|SCROLL_PRODUCT|SCROLL_MID": 11,
  "HOME|HOVER_ELEMENT|HOVER_SHORT": 12,
  "PRODUCT|SCROLL_PRODUCT|SCROLL_LOW": 13,
  "PRODUCT|ADD_CART|CLICK": 14,
  "PRODUCT|VIEW_REVIEW|HOVER_SHORT": 15,
  "HOME|CLICK_ELEMENT|CLICK": 16,
  "HOME|SCROLL_HOME|SCROLL_LOW": 17,
  "PRODUCT|SCROLL_PRODUCT|SCROLL_HIGH": 18,
  "PRODUCT|CHECK_PRICE|HOVER_SHORT": 19,
  "PRODUCT|VIEW_REVIEW|CLICK": 20,
  "PRODUCT|SCROLL_PRODUCT_DETAIL|SCROLL_HIGH": 21,
  "PRODUCT|SCROLL_REVIEW|SCROLL_MID": 22,
  "PRODUCT|SCROLL_REVIEW|SCROLL_HIGH": 23,
  "PRODUCT|SCROLL_PRODUCT_DETAIL|SCROLL_MID": 24,
  "CART|ENTER_CART|NONE": 25,
  "PRODUCT|SCROLL_PRODUCT_DETAIL|SCROLL_LOW": 26,
  "PRODUCT|DISTRACTED_EPISODE|REPEAT": 27,
  "PRODUCT|CHECK_SIZE|HOVER_SHORT": 28,
  "PRODUCT|ADD_CART|HOVER_SHORT": 29,
  "HOME|SCROLL_HOME|SCROLL_MID": 30,
  "PRODUCT|CHECK_SHIPPING|HOVER_SHORT": 31,
  "PRODUCT|CHECK_SHIPPING|CLICK": 32,
  "CHECKOUT|ENTER_CHECKOUT|NONE": 33,
  "PRODUCT|TAB_OUT|NONE": 34,
  "PRODUCT|CHECK_SIZE|CLICK": 35,
  "CHECKOUT|START_INPUT|FOCUS": 36,
  "CHECKOUT|EDIT_INPUT|CHANGE": 37,
  "PRODUCT|SCROLL_PRODUCT|SCROLL_UNKNOWN": 38,
  "PRODUCT|START_SESSION|NONE": 39,
  "CART|CHECK_SHIPPING|HOVER_SHORT": 40,
  "CART|CLICK_BUY|CLICK": 41,
  "HOME|DISTRACTED_EPISODE|REPEAT": 42,
  "PRODUCT|SCROLL_PRICE|SCROLL_HIGH": 43,
  "HOME|ADD_CART|HOVER_SHORT": 44,
  "PRODUCT|SCROLL_PRICE|SCROLLED": 45,
  "CART|CLICK_ELEMENT|CLICK": 46,
  "CHECKOUT|CLICK_BUY|CLICK": 47,
  "CART|CHECK_PRICE|HOVER_SHORT": 48,
  "HOME|CHECK_SHIPPING|HOVER_SHORT": 49,
  "HOME|SCROLL_HOME|SCROLL_HIGH": 50,
  "CHECKOUT|CHECK_PRICE|HOVER_SHORT": 51,
  "CART|HOVER_ELEMENT|HOVER_SHORT": 52,
  "CART|DISTRACTED_EPISODE|REPEAT": 53,
  "HOME|TAB_OUT|NONE": 54,
  "PRODUCT|SCROLL_PRICE|SCROLL_UNKNOWN": 55,
  "PRODUCT|INACTIVE|GAP_LONG": 56,
  "CART|REMOVE_CART|CLICK": 57,
  "CHECKOUT|EDIT_INPUT|BLUR": 58,
  "CHECKOUT|SCROLL_PAGE|SCROLL_MID": 59,
  "HOME|SCROLL_HOME|SCROLL_UNKNOWN": 60,
  "HOME|EDIT_INPUT|CHANGE": 61,
  "HOME|INACTIVE|GAP_LONG": 62,
  "PRODUCT|EDIT_INPUT|CHANGE": 63,
  "PRODUCT|START_INPUT|FOCUS": 64,
  "CART|TAB_OUT|NONE": 65,
  "PRODUCT|EDIT_INPUT|BLUR": 66,
  "HOME|CHECK_PRICE|HOVER_SHORT": 67,
  "CART|SCROLL_PAGE|SCROLL_LOW": 68,
  "CHECKOUT|DISTRACTED_EPISODE|REPEAT": 69,
  "PRODUCT|SCROLL_PRICE|SCROLL_LOW": 70,
  "HOME|SEARCH_USE|INPUT": 71,
  "PRODUCT|SCROLL_SIZE|SCROLL_HIGH": 72,
  "HOME|ADD_CART|CLICK": 73,
  "PRODUCT|CHECK_PRICE|CLICK": 74,
  "CART|ADD_CART|HOVER_SHORT": 75,
  "PRODUCT|SEARCH_USE|INPUT": 76,
  "HOME|START_INPUT|FOCUS": 77,
  "PRODUCT|TAB_RETURN|GAP_MEDIUM": 78,
  "CART|ADD_CART|CLICK": 79,
  "HOME|HOVER_ELEMENT|HOVER_LONG": 80,
  "PRODUCT|HOVER_ELEMENT|HOVER_LONG": 81,
  "CART|START_INPUT|FOCUS": 82,
  "CART|INACTIVE|GAP_LONG": 83,
  "CART|EDIT_INPUT|BLUR": 84,
  "PRODUCT|RAGE_CLICK|REPEAT": 85,
  "PRODUCT|TAB_RETURN|GAP_LONG": 86,
  "CHECKOUT|SCROLL_PAGE|SCROLL_LOW": 87,
  "CART|EDIT_INPUT|CHANGE": 88,
  "CHECKOUT|HOVER_ELEMENT|HOVER_SHORT": 89,
  "CHECKOUT|TAB_RETURN|GAP_LONG": 90,
  "CART|SCROLL_PAGE|SCROLL_MID": 91,
  "PRODUCT|INACTIVE|GAP_MEDIUM": 92,
  "HOME|RAGE_CLICK|REPEAT": 93,
  "HOME|EDIT_INPUT|BLUR": 94,
  "HOME|INACTIVE|GAP_SHORT": 95,
  "HOME|INACTIVE|GAP_MEDIUM": 96,
  "HOME|TAB_RETURN|GAP_UNKNOWN": 97,
  "CART|TAB_RETURN|GAP_LONG": 98,
  "PRODUCT|SCROLL_SIZE|SCROLL_MID": 99,
  "CART|SCROLL_PAGE|SCROLL_HIGH": 100,
  "PRODUCT|SCROLL_PRICE|SCROLL_MID": 101,
  "PRODUCT|SCROLL_SIZE|SCROLL_LOW": 102,
  "CHECKOUT|TAB_OUT|NONE": 103,
  "HOME|TAB_RETURN|GAP_LONG": 104,
  "CHECKOUT|CLICK_ELEMENT|CLICK": 105,
  "HOME|TAB_RETURN|GAP_MEDIUM": 106,
  "PRODUCT|CLICK_BUY|CLICK": 107,
  "CHECKOUT|SCROLL_PAGE|SCROLL_HIGH": 108,
  "HOME|CHECK_SHIPPING|CLICK": 109,
  "PRODUCT|ABANDON_INPUT|EMPTY": 110,
  "PRODUCT|ADD_CART|HOVER_LONG": 111,
  "PRODUCT|SCROLL_SIZE|SCROLLED": 112,
  "CHECKOUT|INACTIVE|GAP_LONG": 113,
  "PRODUCT|CHECK_PRICE|HOVER_LONG": 114,
  "UNKNOWN|ENTER_UNKNOWN|NONE": 115,
  "HOME|ADD_CART|HOVER_LONG": 116,
  "PRODUCT|INACTIVE|GAP_SHORT": 117,
  "CART|SCROLL_PAGE|SCROLL_UNKNOWN": 118,
  "CART|CHECK_PRICE|HOVER_LONG": 119,
  "CHECKOUT|ADD_CART|HOVER_SHORT": 120,
  "PRODUCT|CLICK_BUY|HOVER_SHORT": 121,
  "PRODUCT|TAB_RETURN|GAP_UNKNOWN": 122,
  "HOME|VIEW_REVIEW|HOVER_SHORT": 123,
  "HOME|CHECK_PRICE|HOVER_LONG": 124,
  "PRODUCT|SCROLL_SHIPPING|SCROLL_MID": 125,
  "HOME|ABANDON_INPUT|EMPTY": 126,
  "HOME|CLICK_BUY|CLICK": 127,
  "CART|HOVER_ELEMENT|HOVER_LONG": 128,
  "HOME|CHECK_SHIPPING|HOVER_LONG": 129,
  "CART|ABANDON_INPUT|EMPTY": 130,
  "CART|INACTIVE|GAP_MEDIUM": 131,
  "CHECKOUT|SCROLL_PAGE|SCROLL_UNKNOWN": 132,
  "CHECKOUT|ADD_CART|CLICK": 133,
  "HOME|CHECK_PRICE|CLICK": 134,
  "PRODUCT|TAB_RETURN|GAP_SHORT": 135,
  "CART|START_SESSION|NONE": 136,
  "HOME|CLICK_BUY|HOVER_SHORT": 137,
  "CHECKOUT|INACTIVE|GAP_SHORT": 138,
  "CART|RAGE_CLICK|REPEAT": 139,
  "CART|TAB_RETURN|GAP_SHORT": 140,
  "CART|SEARCH_USE|INPUT": 141,
  "CART|ADD_CART|HOVER_LONG": 142,
  "HOME|CHECK_SIZE|HOVER_SHORT": 143,
  "CART|CHECK_SIZE|HOVER_SHORT": 144,
  "CART|INACTIVE|GAP_SHORT": 145,
  "CHECKOUT|CLICK_BUY|HOVER_SHORT": 146,
  "CHECKOUT|ABANDON_INPUT|EMPTY": 147,
  "PRODUCT|SCROLL_PRODUCT_DETAIL|SCROLL_UNKNOWN": 148,
  "HOME|EXIT_BOUNCE|NONE": 149,
  "CART|TAB_RETURN|GAP_MEDIUM": 150,
  "PRODUCT|SCROLL_SHIPPING|SCROLL_LOW": 151
}