{
  "[PAD]": 0,
  "[UNK]": 1,
  "[MASK]": 2,
  "[CLS]": 3,
  "HOME|HOVER_ELEMENT|HOVER_SHORT": 4,
  "HOME|SCROLL_HOME|SCROLL_LOW": 5,
  "PRODUCT|HOVER_ELEMENT|HOVER_SHORT": 6,
  "HOME|CLICK_ELEMENT|CLICK": 7,
  "PRODUCT|ZOOM_IMAGE|ZOOM": 8,
  "PRODUCT|TAB_OUT|NONE": 9,
  "PRODUCT|CLICK_ELEMENT|CLICK": 10,
  "PRODUCT|INACTIVE|GAP_LONG": 11,
  "PRODUCT|ADD_CART|CLICK": 12,
  "PRODUCT|ENTER_PRODUCT|NONE": 13,
  "HOME|TAB_OUT|NONE": 14,
  "PRODUCT|TAB_RETURN|GAP_LONG": 15,
  "PRODUCT|SCROLL_PRODUCT|SCROLL_LOW": 16,
  "HOME|INACTIVE|GAP_LONG": 17,
  "PRODUCT|VIEW_REVIEW|HOVER_SHORT": 18,
  "PRODUCT|ADD_CART|HOVER_SHORT": 19,
  "PRODUCT|VIEW_PRODUCT|CLICK": 20,
  "HOME|ENTER_HOME|NONE": 21,
  "HOME|SCROLL_HOME|SCROLL_MID": 22,
  "HOME|START_SESSION|NONE": 23,
  "PRODUCT|CHECK_PRICE|HOVER_SHORT": 24,
  "PRODUCT|SCROLL_PRODUCT|SCROLL_MID": 25,
  "HOME|ADD_CART|HOVER_SHORT": 26,
  "PRODUCT|SCROLL_PRODUCT|SCROLL_UNKNOWN": 27,
  "CART|CLICK_ELEMENT|CLICK": 28,
  "HOME|CHECK_SHIPPING|HOVER_SHORT": 29,
  "CART|HOVER_ELEMENT|HOVER_SHORT": 30,
  "PRODUCT|SCROLL_PRODUCT|SCROLL_HIGH": 31,
  "HOME|TAB_RETURN|GAP_LONG": 32,
  "PRODUCT|VIEW_REVIEW|CLICK": 33,
  "CART|ENTER_CART|NONE": 34,
  "HOME|EDIT_INPUT|CHANGE": 35,
  "PRODUCT|EDIT_INPUT|CHANGE": 36,
  "PRODUCT|START_SESSION|NONE": 37,
  "HOME|SCROLL_HOME|SCROLL_HIGH": 38,
  "HOME|SCROLL_HOME|SCROLL_UNKNOWN": 39,
  "HOME|CHECK_PRICE|HOVER_SHORT": 40,
  "PRODUCT|EDIT_INPUT|BLUR": 41,
  "PRODUCT|START_INPUT|FOCUS": 42,
  "UNKNOWN|TAB_OUT|NONE": 43,
  "CART|CHECK_PRICE|HOVER_SHORT": 44,
  "PRODUCT|INACTIVE|GAP_MEDIUM": 45,
  "HOME|INACTIVE|GAP_MEDIUM": 46,
  "HOME|SEARCH_USE|INPUT": 47,
  "PRODUCT|CHECK_SHIPPING|HOVER_SHORT": 48,
  "PRODUCT|TAB_RETURN|GAP_SHORT": 49,
  "HOME|ADD_CART|CLICK": 50,
  "PRODUCT|SEARCH_USE|INPUT": 51,
  "PRODUCT|INACTIVE|GAP_SHORT": 52,
  "HOME|START_INPUT|FOCUS": 53,
  "HOME|INACTIVE|GAP_SHORT": 54,
  "UNKNOWN|INACTIVE|GAP_LONG": 55,
  "HOME|HOVER_ELEMENT|HOVER_LONG": 56,
  "PRODUCT|HOVER_ELEMENT|HOVER_LONG": 57,
  "CART|START_INPUT|FOCUS": 58,
  "CART|ADD_CART|HOVER_SHORT": 59,
  "CART|TAB_OUT|NONE": 60,
  "HOME|TAB_RETURN|GAP_MEDIUM": 61,
  "CART|EDIT_INPUT|BLUR": 62,
  "PRODUCT|RAGE_CLICK|REPEAT": 63,
  "CART|ADD_CART|CLICK": 64,
  "CHECKOUT|SCROLL_PAGE|SCROLL_LOW": 65,
  "CHECKOUT|SCROLL_PAGE|SCROLL_MID": 66,
  "UNKNOWN|TAB_RETURN|GAP_LONG": 67,
  "CART|EDIT_INPUT|CHANGE": 68,
  "CHECKOUT|HOVER_ELEMENT|HOVER_SHORT": 69,
  "PRODUCT|CHECK_SIZE|HOVER_SHORT": 70,
  "PRODUCT|TAB_RETURN|GAP_MEDIUM": 71,
  "CART|SCROLL_PAGE|SCROLL_MID": 72,
  "CART|INACTIVE|GAP_LONG": 73,
  "HOME|RAGE_CLICK|REPEAT": 74,
  "HOME|EDIT_INPUT|BLUR": 75,
  "UNKNOWN|START_SESSION|NONE": 76,
  "PRODUCT|SCROLL_PRICE|SCROLL_MID": 77,
  "CART|SCROLL_PAGE|SCROLL_LOW": 78,
  "UNKNOWN|CLICK_ELEMENT|CLICK": 79,
  "PRODUCT|CHECK_PRICE|CLICK": 80,
  "CART|REMOVE_CART|CLICK": 81,
  "PRODUCT|SCROLL_PRICE|SCROLL_LOW": 82,
  "PRODUCT|SCROLL_PRICE|SCROLL_HIGH": 83,
  "CART|SCROLL_PAGE|SCROLL_HIGH": 84,
  "CHECKOUT|ENTER_CHECKOUT|NONE": 85,
  "CHECKOUT|CLICK_ELEMENT|CLICK": 86,
  "CHECKOUT|CHECK_PRICE|HOVER_SHORT": 87,
  "PRODUCT|CLICK_BUY|CLICK": 88,
  "PRODUCT|SCROLL_PRICE|SCROLL_UNKNOWN": 89,
  "CHECKOUT|CLICK_BUY|CLICK": 90,
  "CHECKOUT|SCROLL_PAGE|SCROLL_HIGH": 91,
  "CART|CHECK_SHIPPING|HOVER_SHORT": 92,
  "HOME|CHECK_SHIPPING|CLICK": 93,
  "HOME|TAB_RETURN|GAP_UNKNOWN": 94,
  "CART|TAB_RETURN|GAP_LONG": 95,
  "HOME|TAB_RETURN|GAP_SHORT": 96,
  "UNKNOWN|ENTER_UNKNOWN|NONE": 97,
  "UNKNOWN|HOVER_ELEMENT|HOVER_SHORT": 98,
  "UNKNOWN|INACTIVE|GAP_MEDIUM": 99,
  "HOME|ADD_CART|HOVER_LONG": 100,
  "CART|SCROLL_PAGE|SCROLL_UNKNOWN": 101,
  "CART|CHECK_PRICE|HOVER_LONG": 102,
  "CHECKOUT|ADD_CART|HOVER_SHORT": 103,
  "PRODUCT|TAB_RETURN|GAP_UNKNOWN": 104,
  "PRODUCT|ABANDON_INPUT|EMPTY": 105,
  "PRODUCT|CLICK_BUY|HOVER_SHORT": 106,
  "HOME|VIEW_REVIEW|HOVER_SHORT": 107,
  "HOME|CHECK_PRICE|HOVER_LONG": 108,
  "PRODUCT|SCROLL_PRODUCT_DETAIL|SCROLL_MID": 109,
  "PRODUCT|SCROLL_PRODUCT_DETAIL|SCROLL_HIGH": 110,
  "HOME|ABANDON_INPUT|EMPTY": 111,
  "HOME|CLICK_BUY|CLICK": 112,
  "CART|HOVER_ELEMENT|HOVER_LONG": 113,
  "CHECKOUT|TAB_OUT|NONE": 114,
  "HOME|CHECK_SHIPPING|HOVER_LONG": 115,
  "CART|ABANDON_INPUT|EMPTY": 116,
  "CART|INACTIVE|GAP_MEDIUM": 117,
  "CHECKOUT|SCROLL_PAGE|SCROLL_UNKNOWN": 118,
  "CHECKOUT|ADD_CART|CLICK": 119,
  "CART|CLICK_BUY|CLICK": 120,
  "CART|START_SESSION|NONE": 121,
  "HOME|CLICK_BUY|HOVER_SHORT": 122,
  "PRODUCT|SCROLL_REVIEW|SCROLL_HIGH": 123,
  "PRODUCT|SCROLL_REVIEW|SCROLL_MID": 124,
  "PRODUCT|CHECK_SHIPPING|CLICK": 125,
  "PRODUCT|SCROLL_PRODUCT_DETAIL|SCROLL_LOW": 126,
  "PRODUCT|CHECK_PRICE|HOVER_LONG": 127,
  "CHECKOUT|EDIT_INPUT|CHANGE": 128,
  "UNKNOWN|TAB_RETURN|GAP_SHORT": 129,
  "UNKNOWN|TAB_RETURN|GAP_UNKNOWN": 130,
  "CHECKOUT|TAB_RETURN|GAP_LONG": 131,
  "CHECKOUT|INACTIVE|GAP_LONG": 132,
  "CHECKOUT|INACTIVE|GAP_SHORT": 133,
  "HOME|CHECK_PRICE|CLICK": 134,
  "CART|RAGE_CLICK|REPEAT": 135,
  "CART|TAB_RETURN|GAP_SHORT": 136,
  "CART|SEARCH_USE|INPUT": 137,
  "CART|ADD_CART|HOVER_LONG": 138,
  "HOME|CHECK_SIZE|HOVER_SHORT": 139,
  "CART|CHECK_SIZE|HOVER_SHORT": 140,
  "CART|INACTIVE|GAP_SHORT": 141,
  "PRODUCT|CHECK_SIZE|CLICK": 142,
  "CHECKOUT|CLICK_BUY|HOVER_SHORT": 143,
  "CHECKOUT|START_INPUT|FOCUS": 144,
  "CHECKOUT|EDIT_INPUT|BLUR": 145,
  "CHECKOUT|ABANDON_INPUT|EMPTY": 146,
  "PRODUCT|SCROLL_PRODUCT_DETAIL|SCROLL_UNKNOWN": 147,
  "PRODUCT|ADD_CART|HOVER_LONG": 148
}